/*   Javascript 常用的陣列方法   */

/* ----- map --------- */
var 陣列 = ["蛇", "蛋", "肅", "夫", "莽"];

// pass a function to map
const 輸出陣列 = 陣列.map(內容 => "魯" + 內容);

console.log(輸出陣列);

/* ----- forEach ----- */
var 日常生活 = ["賴床", "打卡上班", "煩惱午餐", "揪下午茶", "不敢下班", "回家睡覺"];

日常生活.forEach(function(任務) {
  開始執行(任務); //?
});

/* ----- filter ----- */
var 男性追求者身高 = [170, 176, 181, 187, 168, 177, 183];

const 有機會的追求者身高 = 男性追求者身高.filter(身高 => 身高 > 180);

console.log(有機會的追求者身高);

/* ----- slice ----- */
var 班兵 = ["班頭","班二","班三","班四","班五","班六","班七","班八","班九","班十"];

var 搬器材人員 = 班兵.slice(0,5); //?

var 出公差人員 = 班兵.slice(6); //?

var 站哨人員 = 班兵.slice(-2); //?

var 榮譽假人員 = 班兵.slice(5,-2); //?

/* ----- reduce ----- */
const 臉書貼文的心情 = ['哈', '哈', '讚', '哇', '大心', '哈', '哇', '嗚', '怒', 
  '嗚', '讚', '大心', '嗚', '大心', '哈', '哈', '讚', '怒', '嗚'];

const 總結心情數量的方法 = (累加分類心情數, 目前的心情) => {
  累加分類心情數[目前的心情] = 累加分類心情數[目前的心情] + 1
  return 累加分類心情數
}

const 初始心情統計 = { '讚': 0, '哈': 0, '大心': 0, '哇': 0, '嗚': 0, '怒': 0 }

const 總結心情統計 = 臉書貼文的心情.reduce(總結心情數量的方法, 初始心情統計) 

console.log(總結心情統計)

function 開始執行(事情) {
  console.log(事情);
  return '我'+事情
}
